td/td1/td1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="fr" xml:lang="fr">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>TD1: Introduction et notions fondamentales</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Roland Donat" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="https://roland-donat.github.io/ubs/Charte_graphique/IUT/ubs_iut_vannes.css" />
</head>
<body>
<div id="content">
<h1 class="title">TD1: Introduction et notions fondamentales</h1>
<div id="table-of-contents">
<h2>Table des matières</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org39ce481">1. Préambule</a>
<ul>
<li><a href="#org644c5bd">1.1. Crédit</a></li>
<li><a href="#org466ecee">1.2. Environnement logiciel</a></li>
</ul>
</li>
<li><a href="#org24d2d58">2. Introduction</a></li>
<li><a href="#org4223fc3">3. Modules <code>Python</code> utilisés dans ce TD</a></li>
<li><a href="#orgd702981">4. Chargement des données et premières analyses</a></li>
<li><a href="#org689de58">5. Distance euclidienne</a></li>
<li><a href="#org0f7b9a9">6. Inertie totale</a></li>
<li><a href="#org420a42a">7. Première partition \(C_{\text{A}}\)</a>
<ul>
<li><a href="#org89028bb">7.1. Construction des classes</a></li>
<li><a href="#org513214b">7.2. Inertie intra-classe</a></li>
<li><a href="#orgdbf4506">7.3. Inertie inter-classe</a></li>
</ul>
</li>
<li><a href="#org753fa7d">8. Seconde partition \(C_{\text{B}}\)</a></li>
</ul>
</div>
</div>

<div id="outline-container-org39ce481" class="outline-2">
<h2 id="org39ce481"><span class="section-number-2">1</span> Préambule</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org644c5bd" class="outline-3">
<h3 id="org644c5bd"><span class="section-number-3">1.1</span> Crédit</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Ce TD reprend la trame du <a href="https://moodle.univ-ubs.fr/pluginfile.php/360513/mod_resource/content/2/TDR1.pdf">TD de classification non supervisée</a> proposé par Mme. Arlette Antoni en
2019-2020. Le TD original était réalisé avec le logiciel <code>R</code> tandis que nous allons utiliser le
logiciel <code>Python</code>.
</p>
</div>
</div>

<div id="outline-container-org466ecee" class="outline-3">
<h3 id="org466ecee"><span class="section-number-3">1.2</span> Environnement logiciel</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Les travaux se dérouleront sous <code>Python</code>. Si vous disposez d'une connexion internet, je vous
recommande d'utiliser une plateforme de <i>Notebooks</i> en ligne telle que
<a href="https://deepnote.com"><code>DeepNote</code></a> sinon vous pouvez
toujours utiliser <code>Python</code> en local en installant la distribution <a href="https://www.anaconda.com/products/individual"><code>Anaconda</code></a>. L'important est de vous
assurer que vous utilisez bien la version <code>3.8</code> ou plus de <code>Python</code>.
</p>
</div>
</div>
</div>

<div id="outline-container-org24d2d58" class="outline-2">
<h2 id="org24d2d58"><span class="section-number-2">2</span> Introduction</h2>
<div class="outline-text-2" id="text-2">
<p>
L'objectif de ce TD est de mettre en pratique les principales notions vues en cours en les
appliquant sur un jeu de données réel.
</p>

<p>
Pour ce faire, nous utiliserons une adaptation des données libres <a href="https://archive.ics.uci.edu/ml/datasets/wine">Wine Data Set</a> ne conservant que
les variables quantitatives pour la mise en oeuvre de méthodes de classification non supervisée.
</p>

<p>
Les données correspondent aux résultats d'analyses chimiques sur des vins issus d'une même région
d'Italie mais produits par trois vignerons différents. L'analyse quantifie la présence des 13
éléments suivants :  
</p>
<ul class="org-ul">
<li>Alcohol</li>
<li>Malic acid</li>
<li>Ash</li>
<li>Alcalinity of ash</li>
<li>Magnesium</li>
<li>Total phenols</li>
<li>Flavanoids</li>
<li>Nonflavanoid phenols</li>
<li>Proanthocyanins</li>
<li>Color intensity</li>
<li>Hue</li>
<li>OD280/OD315 of diluted wines</li>
<li>Proline</li>
</ul>

<p>
Les données retravaillées à utiliser dans ce TD sont <a href="https://roland-donat.github.io/cours-class-non-sup/td/td1/wine.csv">disponibles à ici</a>.
</p>
</div>
</div>
