td/td1/td1.html

<div id="outline-container-org4223fc3" class="outline-2">
<h2 id="org4223fc3"><span class="section-number-2">3</span> Modules <code>Python</code> utilisés dans ce TD</h2>
<div class="outline-text-2" id="text-3">
<p>
Dans ce TD, nous utiliserons les modules <code>Python</code> suivants :
</p>
<ul class="org-ul">
<li><code>pandas</code>, pour la manipulation des données ;</li>
<li><code>plotly</code>, pour les représentations graphiques ;</li>
<li><code>numpy</code>, pour utiliser des fonctions de calculs numériques "bas niveau", e.g. génération de
nombres aléatoires ;</li>
<li><code>scipy</code>, pour utiliser d'autres fonctions de calculs numériques plus "haut niveau", e.g. calcul de
distances.</li>
</ul>

<p>
Ces modules ne sont pas forcément installés dans votre environnement local ou en ligne. Vous pouvez
donc utiliser la commande <code>!pip install &lt;nom_module&gt;</code> pour les installer : 
</p>
<div class="org-src-container">
<pre class="src src-python">!pip install pandas==<span style="color: #CC9393;">'1.2.5'</span>
!pip install plotly==<span style="color: #CC9393;">'5.6.0'</span>
!pip install scipy==<span style="color: #CC9393;">"1.7.3"</span>
</pre>
</div>


<p>
Rappel : code d'import des modules :
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #F0DFAF; font-weight: bold;">import</span> pandas <span style="color: #F0DFAF; font-weight: bold;">as</span> pd
<span style="color: #F0DFAF; font-weight: bold;">import</span> numpy <span style="color: #F0DFAF; font-weight: bold;">as</span> np
<span style="color: #F0DFAF; font-weight: bold;">import</span> plotly <span style="color: #F0DFAF; font-weight: bold;">as</span> pl
<span style="color: #F0DFAF; font-weight: bold;">import</span> plotly.express <span style="color: #F0DFAF; font-weight: bold;">as</span> px
<span style="color: #F0DFAF; font-weight: bold;">import</span> scipy <span style="color: #F0DFAF; font-weight: bold;">as</span> sc
<span style="color: #F0DFAF; font-weight: bold;">import</span> scipy.spatial.distance <span style="color: #F0DFAF; font-weight: bold;">as</span> scd
<span style="color: #F0DFAF; font-weight: bold;">import</span> sklearn <span style="color: #F0DFAF; font-weight: bold;">as</span> sk

<span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">V&#233;rification des versions des librairies utilis&#233;es</span>
{<span style="color: #CC9393;">"plotly"</span>: pl.__version__, 
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span><span style="color: #CC9393;">"pandas"</span>: pd.__version__, 
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span><span style="color: #CC9393;">"numpy"</span>: np.__version__, 
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span><span style="color: #CC9393;">"scipy"</span>: sc.__version__}
</pre>
</div>
</div>
</div>


<div id="outline-container-orgd702981" class="outline-2">
<h2 id="orgd702981"><span class="section-number-2">4</span> Chargement des données et premières analyses</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li><p>
Chargez les données dans votre environnement à l'aide de la fonction <code>pd.read_csv</code>. 
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #DFAF8F;">data_path</span> = <span style="color: #CC9393;">"https://roland-donat.github.io/cours-class-non-sup/td/td1/wine.csv"</span>
<span style="color: #DFAF8F;">data_df</span> = pd.read_csv(data_path, sep=<span style="color: #CC9393;">","</span>)
</pre>
</div></li>
<li><p>
Faites une rapide analyse exploratoire de vos données :
</p>
<ul class="org-ul">
<li>de manière macroscopique avec les méthodes <code>.head</code>, <code>.describe</code> et <code>.info</code></li>
<li>de manière visuelle en représentant la distribution de chaque variable en utilisant la fonction
<code>px.box</code>. 
Que constatez vous ?</li>
</ul>
<div class="org-src-container">
<pre class="src src-python">data_df.describe()
data_df.info()
px.box(data_df, title=<span style="color: #CC9393;">"Boxplot de chaque variable (donn&#233;e originale)"</span>)
</pre>
</div></li>
<li><p>
Centrez et réduisez les données. Aide : utilisez les méthodes <code>.mean</code> et <code>.std</code> des <code>DataFrame</code>.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #DFAF8F;">data_scaled_df</span> = &lt;&#224; compl&#233;ter&gt;
</pre>
</div></li>
<li>Calculez la matrice des corrélations linéaires avec la méthode <code>.corr</code> des <code>DataFrame</code>. Quelles
sont les caractéristiques remarquables de cette matrice ?</li>
<li><p>
Affichez un diagramme en paire et une carte de chaleur des corrélations linéaires.
</p>
<div class="org-src-container">
<pre class="src src-python">px.imshow(data_df.corr(), 
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span> color_continuous_midpoint=0, 
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span> title=<span style="color: #CC9393;">"Corr&#233;lations lin&#233;aires des donn&#233;es sous forme de carte de chaleur (heatmap)"</span>)
</pre>
</div></li>
</ol>
</div>
</div>


<div id="outline-container-org689de58" class="outline-2">
<h2 id="org689de58"><span class="section-number-2">5</span> Distance euclidienne</h2>
<div class="outline-text-2" id="text-5">
<p>
<b>Dans la suite du TD, nous allons travailler avec les données centrées réduites calculées
précédemment dans le <code>DataFrame</code> <code>data_scaled_df</code>.</b> 
</p>

<ol class="org-ol">
<li>Calculez la distance euclidienne entre les deux premiers individus. Aide :
utilisez la méthode <code>sum</code> des <code>DataFrame</code>.</li>
<li>Calculez la distance euclidienne entre le premier individu et le troisième, puis entre le
deuxième et le troisième.</li>
<li><p>
Calculez la matrice des distances euclidiennes. Aide : utilisez les fonctions <code>pdist</code> et
<code>squareform</code> du package <code>scipy.spatial.distance</code>. Quelle sera la taille de cette matrice, quelles
seront ses propriétés remarquables ?
</p>
<div class="org-src-container">
<pre class="src src-python">scd.pdist(data_scaled_df, metric=<span style="color: #CC9393;">"euclidean"</span>)
scd.squareform(scd.pdist(data_scaled_df, metric=<span style="color: #CC9393;">"euclidean"</span>))
</pre>
</div></li>
<li>Transformez la matrice de distances précédente sous la forme d'un <code>DataFrame</code> pour en améliorer
la lisibilité. Vérifiez que les distances calculées aux points 1 et 2 grâce à la matrice des distances calculée au
point 3.</li>
</ol>
</div>
</div>

<div id="outline-container-org0f7b9a9" class="outline-2">
<h2 id="org0f7b9a9"><span class="section-number-2">6</span> Inertie totale</h2>
<div class="outline-text-2" id="text-6">
<p>
<b>Dans la suite du TD, les données seront considérées comme étant équipondérées avec un poids de 1
pour chaque observation. Par ailleurs, la distance utilisée sera la distance euclidienne.</b> 
</p>

<p>
<b>Nous travaillons toujours avec les données centrées réduites du <code>DataFrame</code> <code>data_scaled_df</code>.</b> 
</p>

<ol class="org-ol">
<li>Calculer le centre de gravité du nuage d'observations.</li>
<li>Calculer les distances au carré entre les observations et le centre de gravité du nuage.</li>
<li>En déduire l'inertie totale des données.</li>
<li>Calculer la somme des variance empirique de chaque variable. Aide : utilisez la méthode <code>.var</code> des
<code>DataFrame</code> ? Quels calculs fait exactement la méthode <code>.var</code> ? Aurait t-on pu prévoir le résultat
dans ce cas ?</li>
<li>Comparez l'inertie totale avec la somme des variances des variables.</li>
</ol>
</div>
</div>

<div id="outline-container-org420a42a" class="outline-2">
<h2 id="org420a42a"><span class="section-number-2">7</span> Première partition \(C_{\text{A}}\)</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org89028bb" class="outline-3">
<h3 id="org89028bb"><span class="section-number-3">7.1</span> Construction des classes</h3>
<div class="outline-text-3" id="text-7-1">
<p>
Nous allons nous donner une première partition \(C_{\text{A}}\) totalement arbitraire consistant à affecter :
</p>
<ul class="org-ul">
<li>la classe \(c_{1}\) aux individus d'indices 0-49 ;</li>
<li>la classe \(c_{2}\) aux individus d'indices 50-99 ;</li>
<li>la classe \(c_{3}\) aux individus d'indices 100-177.</li>
</ul>

<p>
<b>Rappel :</b> N'oubliez pas que <code>Python</code> indexe les listes, vecteurs, tableaux en commençant à 0 !
</p>

<ol class="org-ol">
<li><p>
Ajoutez une nouvelle variable <code>cls_A</code> contenant la classe de chaque individu suivant le schéma
décrit précédemment.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #DFAF8F;">data_scaled_df</span>[<span style="color: #CC9393;">"cls_A"</span>] = <span style="color: #CC9393;">"c1"</span>
data_scaled_df[<span style="color: #CC9393;">"cls_A"</span>]<span style="color: #DFAF8F;">.loc</span>[50:99] = <span style="color: #CC9393;">"c2"</span>
data_scaled_df[<span style="color: #CC9393;">"cls_A"</span>]<span style="color: #DFAF8F;">.loc</span>[100:] = <span style="color: #CC9393;">"c3"</span>
</pre>
</div></li>
<li>Visualiser le nuage d'individus sur les variables <code>OD280</code> et <code>Alcohol</code> en faisant apparaître
votre partition. Aide : utilisez la fonction <code>px.scatter</code> en utilisant l'option <code>color</code> pour
colorer les individus en fonction de leur classe.</li>
</ol>
</div>
</div>
