td/td1/td1.org
** Inertie intra-classe

1. Calculez le centre de gravité de chaque classe. Aide : utilisez la méthode =groupby= des
   =DataFrame= afin de regrouper les données sur la variable de classe et réaliser des traitements
   sur chaque groupe.
2. Calculez l'inertie interne de chaque classe.
3. En déduire l'inertie intra-classe de la partition.
4. En déduire l'inertie inter-classe de la partition.
5. Calculez le % d'inertie expliquée par la partition.
6. Calculez la somme des variances empiriques corrigées des variables au sein de chaque classe.
7. Comparez les inerties internes et le résultat de la question 6.
8. Comment calculer l'inertie intra-classe de la partition à partir de la question 6.


** Inertie inter-classe

1. Calculez le carré des distances entre le centre de gravité des classes et le centre de gravité
   des données.
2. En déduire l'inertie inter-classe de la partition.


* Seconde partition $C_{\text{B}}$

Reprendre les questions de la partie précédente en construisant une partition $C_{\text{B}}$ au
hasard. Pour ce faire, utilisez la fonction =np.ramdom.choice= pour affecter les classes aux
individus. N'hésitez pas à fixer la graine du générateur aléatoire avec la fonction =np.random.seed=
afin de reproduire le "même hasard" d'une exécution à l'autre de votre script. 

#+BEGIN_SRC python :results silent :exports code
# On fixe la graîne du générateur de nombre aléatoire pour 
# reproduire le même "hasard" d'une exécution à l'autre
np.random.seed(56)

# Initalisation au hasard de la partition
data_scaled_df["cls_B"] = np.random.choice(["c1", "c2", "c3"],
                                            len(data_scaled_df))

N_cls_B = data_scaled_df["cls_B"].value_counts()
N_cls_B
#+END_SRC
