td/td1/td1.html


<div id="outline-container-org513214b" class="outline-3">
<h3 id="org513214b"><span class="section-number-3">7.2</span> Inertie intra-classe</h3>
<div class="outline-text-3" id="text-7-2">
<ol class="org-ol">
<li>Calculez le centre de gravité de chaque classe. Aide : utilisez la méthode <code>groupby</code> des
<code>DataFrame</code> afin de regrouper les données sur la variable de classe et réaliser des traitements
sur chaque groupe.</li>
<li>Calculez l'inertie interne de chaque classe.</li>
<li>En déduire l'inertie intra-classe de la partition.</li>
<li>En déduire l'inertie inter-classe de la partition.</li>
<li>Calculez le % d'inertie expliquée par la partition.</li>
<li>Calculez la somme des variances empiriques corrigées des variables au sein de chaque classe.</li>
<li>Comparez les inerties internes et le résultat de la question 6.</li>
<li>Comment calculer l'inertie intra-classe de la partition à partir de la question 6.</li>
</ol>
</div>
</div>


<div id="outline-container-orgdbf4506" class="outline-3">
<h3 id="orgdbf4506"><span class="section-number-3">7.3</span> Inertie inter-classe</h3>
<div class="outline-text-3" id="text-7-3">
<ol class="org-ol">
<li>Calculez le carré des distances entre le centre de gravité des classes et le centre de gravité
des données.</li>
<li>En déduire l'inertie inter-classe de la partition.</li>
</ol>
</div>
</div>
</div>


<div id="outline-container-org753fa7d" class="outline-2">
<h2 id="org753fa7d"><span class="section-number-2">8</span> Seconde partition \(C_{\text{B}}\)</h2>
<div class="outline-text-2" id="text-8">
<p>
Reprendre les questions de la partie précédente en construisant une partition \(C_{\text{B}}\) au
hasard. Pour ce faire, utilisez la fonction <code>np.ramdom.choice</code> pour affecter les classes aux
individus. N'hésitez pas à fixer la graine du générateur aléatoire avec la fonction <code>np.random.seed</code>
afin de reproduire le "même hasard" d'une exécution à l'autre de votre script. 
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">On fixe la gra&#238;ne du g&#233;n&#233;rateur de nombre al&#233;atoire pour </span>
<span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">reproduire le m&#234;me "hasard" d'une ex&#233;cution &#224; l'autre</span>
np.random.seed(56)

<span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">Initalisation au hasard de la partition</span>
<span style="color: #DFAF8F;">data_scaled_df</span>[<span style="color: #CC9393;">"cls_B"</span>] = np.random.choice([<span style="color: #CC9393;">"c1"</span>, <span style="color: #CC9393;">"c2"</span>, <span style="color: #CC9393;">"c3"</span>],
<span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; background-color: #4F4F4F;"> </span>   <span style="color: #DCDCCC; font-weight: bold;">len</span>(data_scaled_df))

<span style="color: #DFAF8F;">N_cls_B</span> = data_scaled_df[<span style="color: #CC9393;">"cls_B"</span>].value_counts()
N_cls_B
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
